{
   "users": [
      {
         "id": 1,
         "userName": "Алина Васько",
         "role": "student",
         "age": "30",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=LongHairStraight&accessoriesType=Blank&hairColor=Brown&facialHairType=Blank&clotheType=ShirtCrewNeck&clotheColor=Gray02&eyeType=Squint&eyebrowType=AngryNatural&mouthType=Tongue&skinColor=Pale",
         "aboutUser": "Я — будущая frontend-разработчица с большим интересом к созданию современных веб-приложений. Люблю работать с анимациями и делаю упор на пользовательский опыт. Вне работы занимаюсь йогой и обожаю путешествия. Верю, что через код можно воплотить самые смелые идеи.",
         "title": "Пришла в разработку, потому что знаю, что за разработкой приложений и AI-будущее.",
         "tasks": "В этом проекте я создала адаптивный дизайн и интерфейс для всех страниц приложения. Занималась версткой и внедрением стилей, чтобы проект выглядел современно и был удобен для пользователей. Реализовала анимации и интерактивные элементы, добавив жизни в пользовательский интерфейс. Также участвовала в оптимизации кода для лучшей производительности.",
         "skills": [
            { "name": "React", "progress": 75 },
            { "name": "JavaScript", "progress": 85 },
            { "name": "HTML", "progress": 90 },
            { "name": "CSS", "progress": 80 },
            { "name": "NextJS", "progress": 65 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/2d/b7/dc/2db7dcdeb76c699ede1d8f7064f962cd.jpg",
            "https://i.pinimg.com/564x/41/97/61/419761eb5142715cd6019a2370fe8294.jpg",
            "https://i.pinimg.com/564x/65/06/a7/6506a7ec9b598a17a2e372bf930834fc.jpg"
         ],
         "projectDescription": "Я создаю адаптивные и визуально привлекательные веб-приложения, с акцентом на пользовательский опыт и современные анимации. Мои проекты отличаются качественным дизайном и эффективной версткой, что обеспечивает удобство и интерактивность для пользователей."
      },
      {
         "id": 2,
         "userName": "Дмитрий Кремень",
         "role": "teamlead",
         "age": "23",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=ShortHairShortRound&accessoriesType=Blank&hairColor=Black&facialHairType=Blank&clotheType=BlazerShirt&eyeType=Side&eyebrowType=Angry&mouthType=Smile&skinColor=Pale",
         "aboutUser": "Я увлекаюсь машинным обучением и работаю над созданием умных алгоритмов, которые могут решать сложные задачи. Моя цель — применить искусственный интеллект в реальных проектах для улучшения жизни людей. В свободное время изучаю новые языки программирования и играю в шахматы. Люблю разгадывать головоломки и всегда стремлюсь к совершенству в своем деле.",
         "title": "Пришел в разработку, потому что искусственный интеллект — это будущее, которое я хочу создавать.",
         "tasks": "В этом проекте я разработал структуру и логику приложения, создав основу для всех его компонентов. Занимался проектированием архитектуры и выбором технологий, чтобы проект был масштабируемым и гибким. Настроил взаимодействие между фронтендом и бэкендом, обеспечив плавную работу приложения. Также работал над оптимизацией кода, чтобы сократить время загрузки и улучшить производительность.",
         "skills": [
            { "name": "React", "progress": 80 },
            { "name": "JavaScript", "progress": 85 },
            { "name": "HTML", "progress": 75 },
            { "name": "CSS", "progress": 70 },
            { "name": "NextJS", "progress": 60 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/bf/16/66/bf1666e59674775e75f2e57342c55cb3.jpg",
            "https://i.pinimg.com/564x/6c/48/7e/6c487e8674e4adc995439c401d9bf3b4.jpg",
            "https://i.pinimg.com/564x/b1/73/9b/b1739b5a5820f26d9710d1368763cd4f.jpg"
         ],
         "projectDescription": "Разрабатываю комплексные архитектурные решения для приложений, обеспечивая их масштабируемость и гибкость. Мои проекты включают разработку логики приложения, интеграцию фронтенда с бэкендом и оптимизацию кода для повышения производительности."
      },
      {
         "id": 3,
         "userName": "Александр Грошев",
         "role": "student",
         "age": "?",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=ShortHairTheCaesar&accessoriesType=Blank&hairColor=Black&facialHairType=Blank&clotheType=GraphicShirt&clotheColor=Red&graphicType=Deer&eyeType=Happy&eyebrowType=RaisedExcited&mouthType=Smile&skinColor=Light",
         "aboutUser": "Я специализируюсь на мобильной разработке и стремлюсь создавать приложения, которые упрощают жизнь пользователей. Люблю экспериментировать с новыми фреймворками и стараюсь всегда быть в курсе последних тенденций в мобильных технологиях. В свободное время занимаюсь спортом и изучаю психологию. Мне интересно, как цифровые продукты влияют на поведение людей.",
         "title": "Пришел в разработку, потому что хочу создавать приложения, которые действительно помогают людям.",
         "tasks": "В этом проекте я реализовал логику работы слайд-бара и его интеграцию с основными компонентами. Создал интерактивные элементы и обеспечил их правильную работу в разных браузерах. Занимался настройкой роутинга и связью между страницами, чтобы пользователи могли удобно перемещаться по приложению. Также внес вклад в отладку и тестирование фронтенд-части, улучшив общую стабильность приложения.",
         "skills": [
            { "name": "React", "progress": 70 },
            { "name": "JavaScript", "progress": 65 },
            { "name": "HTML", "progress": 85 },
            { "name": "CSS", "progress": 75 },
            { "name": "NextJS", "progress": 60 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/73/26/e0/7326e0d56596a2ded8de8397b27e8742.jpg",
            "https://i.pinimg.com/564x/fa/c3/e0/fac3e0e90af614be4ab0f045b2a26703.jpg",
            "https://i.pinimg.com/736x/a2/12/53/a21253f11108d6f0151829bd45c800cd.jpg"
         ],
         "projectDescription": "Мои проекты в мобильной разработке включают создание интуитивно понятных интерфейсов и настройку функциональных элементов для улучшения пользовательского опыта. Я фокусируюсь на адаптивности и стабильности приложений на разных устройствах."
      },
      {
         "id": 4,
         "userName": "Иван Кузнецов",
         "role": "npc",
         "age": "26",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=LongHairStraight2&accessoriesType=Prescription02&hairColor=BlondeGolden&facialHairType=Blank&clotheType=BlazerShirt&eyeType=Side&eyebrowType=RaisedExcitedNatural&mouthType=Smile&skinColor=Pale",
         "aboutUser": "Я занимаюсь backend-разработкой и люблю погружаться в задачи, требующие аналитического подхода. Моя страсть — оптимизация и повышение производительности приложений. В свободное время увлекаюсь кибербезопасностью и криптографией. Всегда открыт для новых технологий и не боюсь сложных вызовов.",
         "title": "Пришел в разработку, потому что люблю решать сложные задачи и видеть результаты своей работы.",
         "tasks": "В этом проекте я создал модуль авторизации и регистрации пользователей, обеспечив безопасность данных. Разработал и реализовал функционал для работы с формами, чтобы пользователи могли легко взаимодействовать с приложением. Провел интеграцию с внешними сервисами, чтобы расширить возможности приложения. Также занимался тестированием и рефакторингом кода для повышения надежности системы.",
         "skills": [
            { "name": "React", "progress": 65 },
            { "name": "JavaScript", "progress": 70 },
            { "name": "HTML", "progress": 75 },
            { "name": "CSS", "progress": 60 },
            { "name": "NextJS", "progress": 50 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/ed/06/a3/ed06a37f66cd88262b589c24c757e6d0.jpg",
            "https://i.pinimg.com/564x/fd/be/38/fdbe3894459e8b70bf9fe2015a3c538c.jpg",
            "https://i.pinimg.com/564x/36/dc/48/36dc48bc8cc43fa7e442762402aa42b4.jpg"
         ],
         "projectDescription": "В моих проектах я занимаюсь разработкой надежной backend-логики и интеграцией с базами данных. Обеспечиваю безопасность данных, настройку API и взаимодействие между фронтендом и бэкендом для улучшения функциональности приложений."
      },
      {
         "id": 5,
         "userName": "Алексей Смирнов",
         "role": "npc",
         "age": "35",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=LongHairBigHair&accessoriesType=Wayfarers&hairColor=Blonde&facialHairType=BeardMajestic&facialHairColor=Platinum&clotheType=CollarSweater&clotheColor=PastelOrange&graphicType=Skull&eyeType=Default&eyebrowType=Default&mouthType=Twinkle&skinColor=Brown",
         "aboutUser": "Меня вдохновляет разработка игр и создание интерактивных миров. Я работаю над тем, чтобы каждая игра была не только интересной, но и технологически продвинутой. В свободное время экспериментирую с новыми движками и методами рендеринга. Верю, что игры — это искусство, способное объединить людей и подарить им уникальные впечатления.",
         "title": "Пришел в разработку, потому что мечтаю создавать игры, которые погружают в увлекательные миры.",
         "tasks": "В этом проекте я был ответственен за разработку backend-логики и интеграцию с базой данных. Настроил API для связи фронтенда и базы данных, обеспечив надежный и быстрый обмен данными. Также разработал систему авторизации и аутентификации пользователей для защиты данных. Проводил тестирование и отладку серверной части, чтобы приложение работало без сбоев.",
         "skills": [
            { "name": "React", "progress": 85 },
            { "name": "JavaScript", "progress": 80 },
            { "name": "HTML", "progress": 70 },
            { "name": "CSS", "progress": 60 },
            { "name": "NextJS", "progress": 55 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/ca/ed/d3/caedd379d119716dcb109d23a9792cf0.jpg",
            "https://i.pinimg.com/736x/09/06/63/090663458260e92c44594e7ae91da32d.jpg",
            "https://i.pinimg.com/564x/fc/e3/aa/fce3aa91edc15484bcc54b2933b26b35.jpg"
         ],
         "projectDescription": "В моих проектах в разработке игр акцент сделан на создание технологически продвинутых решений и интеграцию различных систем. Мои работы включают разработку backend-логики, настройку API и системы авторизации, а также тестирование и отладку серверной части."
      },
      {
         "id": 6,
         "userName": "Мария Иванова",
         "role": "npc",
         "age": "28",
         "imageUrl": "https://avataaars.io/?avatarStyle=Circle&topType=LongHairStraight&accessoriesType=Blank&hairColor=Red&facialHairType=Blank&clotheType=GraphicShirt&clotheColor=Gray01&graphicType=Deer&eyeType=Default&eyebrowType=Default&mouthType=Default&skinColor=Light",
         "aboutUser": "Я увлекаюсь веб-разработкой и люблю создавать красивые и функциональные интерфейсы. Моя цель — улучшать пользовательский опыт, применяя лучшие практики и современные технологии. В свободное время занимаюсь фотографией и путешествиями. Верю, что креативность и техническое мастерство могут создавать удивительные продукты.",
         "title": "Пришла в разработку, чтобы делать веб-приложения, которые вдохновляют и радуют пользователей.",
         "tasks": "В этом проекте я разработала макеты и прототипы для новых функций, а также обеспечила их реализацию в коде. Занималась интеграцией с API и настройкой взаимодействия с серверной частью. Провела тестирование и отладку фронтенд-части, чтобы гарантировать её работоспособность на всех устройствах. Также работала над улучшением дизайна и пользовательского опыта.",
         "skills": [
            { "name": "React", "progress": 80 },
            { "name": "JavaScript", "progress": 75 },
            { "name": "HTML", "progress": 90 },
            { "name": "CSS", "progress": 85 },
            { "name": "NextJS", "progress": 70 }
         ],
         "projects": [
            "https://i.pinimg.com/564x/71/e1/e5/71e1e5baa875cf25e2888a783944e4c9.jpg",
            "https://i.pinimg.com/736x/e0/3a/b9/e03ab905b889e76b6a31b9d2630252bc.jpg",
            "https://i.pinimg.com/736x/8b/86/00/8b860016d5871071a6f760d0578c50f7.jpg"
         ],
         "projectDescription": "Мои проекты в веб-разработке включают создание макетов и прототипов, их реализацию в коде и интеграцию с API. Я акцентирую внимание на тестировании, улучшении пользовательского опыта и дизайне, чтобы обеспечить качество и функциональность интерфейсов."
      }
   ]
}
